<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => 'file',

    // 缓存连接方式配置
    'stores'  => [
        'file' => [
            // 驱动方式
            'type'       => 'File',
            // 缓存保存目录
            'path'       => runtime_path() . 'cache',
            // 缓存前缀
            'prefix'     => 'admin_',
            // 缓存有效期 0表示永久缓存
            'expire'     => 7200,
            // 数据压缩
            'data_compress' => false,
        ],
    ],
];
